<?php
/*
 +----------------------------------------------------------------------
 + Title        : Api框架 数据库配置管理
 + Author       : 极资源首席工程师 - 小黄牛
 + Version      : V1.0.0.1
 + Initial-Time : 2017-06-27 08:18
 + Last-time    : 2017-06-27 08:18 + 小黄牛
 + Desc         : 
 +----------------------------------------------------------------------
*/

return [
    /******************************************* 公共数据表名，用于自动切换版本数据库 ************************************/
    'DB_PUBLIC'        => ['channel'],

    /******************************************* 公共数据库配置  *******************************************************/
	"DB_TYPE"          =>  "mysql",     		  	   // 数据库类型
	"DB_HOST"          =>  "localhost", 		   	   // 服务器地址
	"DB_NAME"          =>  "api",      		  	       // 数据库名
	"DB_USER"          =>  "root",   			  	   // 用户名
	"DB_PWD"           =>  "root",       			   // 密码
	"DB_PORT"          =>  "3306",       		  	   // 端口
	"DB_PREFIX"        =>  "api_",    				   // 数据库表前缀
	"DB_CHARSET"       =>  "utf8",   			  	   // 数据库编码



    /******************************************* 版本数据库配置 - V1  *************************************************/
    "V1"               => [
       "Test" => [ // 测试环境
            "DB_TYPE"          =>  "mysql",     		  	   // 数据库类型
            "DB_HOST"          =>  "localhost", 		   	   // 服务器地址
            "DB_NAME"          =>  "v1_test",      		  	   // 数据库名
            "DB_USER"          =>  "root",   			  	   // 用户名
            "DB_PWD"           =>  "root",       			   // 密码
            "DB_PORT"          =>  "3306",       		  	   // 端口
            "DB_PREFIX"        =>  "api_",    				   // 数据库表前缀
            "DB_CHARSET"       =>  "utf8",   			  	   // 数据库编码
       ],
       "Formal" => [ // 生产环境
            "DB_TYPE"          =>  "mysql",     		  	   // 数据库类型
            "DB_HOST"          =>  "localhost", 		   	   // 服务器地址
            "DB_NAME"          =>  "v1_formal",      		   // 数据库名
            "DB_USER"          =>  "root",   			  	   // 用户名
            "DB_PWD"           =>  "root",       			   // 密码
            "DB_PORT"          =>  "3306",       		  	   // 端口
            "DB_PREFIX"        =>  "api_",    				   // 数据库表前缀
            "DB_CHARSET"       =>  "utf8",   			  	   // 数据库编码
       ],
    ],


];
